jae-hee_park/week_05/day_03/moviedatabase/app/views/directors/show.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = ?  [["director_id", 3]]
---

  <% @director.movies.each do |movie| %>