amanda_sam/week_05/day_04/movies_on_rails/app/views/directors/show.html.erb


<% @director.movies.each do |movie| %>
---
SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = ?  [["director_id", 1]]