mitchell_backhouse/week_05/day_03/association_app/app/views/cars/_form.html.erb

SELECT "manufacturers"."name", "manufacturers"."id" FROM "manufacturers"
---
    <%= f.label :manufacturer_id %>
    <%= f.select :manufacturer_id, Manufacturer.pluck(:name, :id) %>