harrison_bourke/week_05/day_03/hw/app/views/authors/show.html.erb


<% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 3]]