harrison_bourke/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.create :name => params[:name], :image => params[:image], :country => params[:country], :elevation => params[:elevation]
---
INSERT INTO "mountains" ("name", "image", "country", "elevation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Mont Blanc"], ["image", ""], ["country", "France"], ["elevation", 4810], ["created_at", "2017-08-22 05:38:16.666372"], ["updated_at", "2017-08-22 05:38:16.666372"]]

  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 4]]

  def update
    mountain = Mountain.find params[:id]
    mountain.update :name => params[:name], :image => params[:image], :country => params[:country], :elevation => params[:elevation]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "mountains" SET "name" = ?, "elevation" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["name", "Mount Kosciuszko Yeah!"], ["elevation", nil], ["updated_at", "2017-08-22 06:06:37.127406"], ["id", 6]]