joshua_mcevoy/week_10/day_01/tweeteater/app/controllers/pages_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def home
    @tweets = Tweet.all