joshua_mcevoy/week_05/day_03/moma/app/views/works/_form.html.erb

SELECT "artists"."name", "artists"."id" FROM "artists"
---
    <%= f.label :artist_id %>
    <%= f.select :artist_id, Artist.pluck(:name, :id), :include_blank => true %>