mitchell_backhouse/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.create name: params[:mountain][:name], image: params[:mountain][:image], location: params[:mountain][:location], elevation: params[:mountain][:elevation], description: params[:mountain][:description]
---
INSERT INTO "mountains" ("name", "image", "location", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["image", ""], ["location", ""], ["description", ""], ["created_at", "2017-08-22 05:30:52.992430"], ["updated_at", "2017-08-22 05:30:52.992430"]]

  def update
    mountain = Mountain.find params[:id]
    mountain.update name: params[:mountain][:name], image: params[:mountain][:image], location: params[:mountain][:location], elevation: params[:mountain][:elevation], description: params[:mountain][:description]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "mountains" SET "location" = ?, "elevation" = ?, "description" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["location", "somewhere on earth"], ["elevation", 7.0], ["description", "this is a small mountain"], ["updated_at", "2017-08-22 05:38:36.131742"], ["id", 7]]

  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 8]]