amanda_sam/week_05/day_03/ocean_on_rails/app/controllers/oceans_controller.rb

SELECT "oceans".* FROM "oceans"
---
  def index
    @oceans = Ocean.all

INSERT INTO "oceans" ("name", "image", "area", "depth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    ocean = Ocean.create :name => params[:name], :image => params[:image], :area => params[:area], :volume => params[:volume], :depth => params[:depth]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @ocean = Ocean.find params[:id]