jae-hee_park/week_05/day_03/moviedatabase/app/views/movies/_form.html.erb

  <%= f.label :director_id %>
  <%= f.select :director_id, Director.pluck(:name, :id), :include_blank => true %>
---
SELECT "directors"."name", "directors"."id" FROM "directors"