mitchell_backhouse/week_05/day_03/association_app/app/views/manufacturers/show.html.erb


<% @manufacturer.cars.each do |c| %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."manufacturer_id" = ?  [["manufacturer_id", 1]]