jae-hee_park/week_05/day_03/moviedatabase/app/controllers/directors_controller.rb

  def index
    @directors = Director.all
---
SELECT "directors".* FROM "directors"

  def create
    director = Director.create director_params
---
INSERT INTO "directors" ("name", "nationality", "dob", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]