jae-hee_park/week_05/day_03/moviedatabase/app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "genre", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["genre", ""], ["image", ""], ["created_at", "2017-08-23 23:39:37.848264"], ["updated_at", "2017-08-23 23:39:37.848264"]]
---
  def create
    movie = Movie.create movie_params

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "director_id" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director_id", 4], ["updated_at", "2017-08-23 10:42:10.042644"], ["id", 2]]
---
  def update
    movie = Movie.find params[:id]
    movie.update movie_params

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find params[:id]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 4]]
---
  def destroy
    movie = Movie.find params[:id]
    movie.destroy