amanda_sam/week_05/day_04/movies_on_rails/app/controllers/directors_controller.rb

  def index
    @directors = Director.all
---
SELECT "directors".* FROM "directors"

  def create
    director = Director.create director_params
---
INSERT INTO "directors" ("name", "nationality", "dob", "award", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "A"], ["nationality", "s"], ["dob", "1980-09-09"], ["award", "Academy Award"], ["image", ""], ["created_at", "2017-08-23 23:51:26.572632"], ["updated_at", "2017-08-23 23:51:26.572632"]]

  def show
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    director = Director.find params[:id]
    director.destroy
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 3]]