amanda_sam/week_05/day_04/movies_on_rails/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "year", "genre", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    movie = Movie.create movie_params

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find params[:id]