harrison_bourke/week_05/day_03/hw/app/controllers/authors_controller.rb

  def create
    author = Author.create author_params
---
INSERT INTO "authors" ("name", "dob", "nationality", "image") VALUES (?, ?, ?, ?)  [["name", "George R R Martin"], ["dob", "1948-09-20"], ["nationality", "American"], ["image", "https://media.wired.com/photos/59265512cfe0d93c4742fd06/1:1/w_2197,c_limit/GeorgeRRMartin1.jpg"]]

  def edit
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    author = Author.find params[:id]
    author.update author_params
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "authors" SET "nationality" = ? WHERE "authors"."id" = ?  [["nationality", "Australian"], ["id", 1]]

  def show
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    author = Author.find params[:id]
    author.destroy
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 5]]