harrison_bourke/week_05/day_03/hw/app/controllers/books_controller.rb

  def create
    book = Book.create book_params
---
INSERT INTO "books" ("title", "year", "genre", "image") VALUES (?, ?, ?, ?)  [["title", "A Song of Ice and Fire"], ["year", "1996"], ["genre", "Fantasy"], ["image", "https://upload.wikimedia.org/wikipedia/en/d/dc/A_Song_of_Ice_and_Fire_book_collection_box_set_cover.jpg"]]

  def show
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    book = Book.find params[:id]
    book.update book_params
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "author_id" = ? WHERE "books"."id" = ?  [["author_id", 3], ["id", 1]]

  def destroy
    book = Book.find params[:id]
    book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]