mitchell_backhouse/week_05/day_03/association_app/app/controllers/cars_controller.rb

INSERT INTO "cars" ("model", "hp", "tq", "category", "image", "manufacturer_id", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    car = Car.create car_params