mitchell_backhouse/week_05/day_03/association_app/app/controllers/manufacturers_controller.rb

SELECT "manufacturers".* FROM "manufacturers"
---
  def index
    @manufacturers = Manufacturer.all

INSERT INTO "manufacturers" ("name", "founded", "description", "image", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    manufacturer = Manufacturer.create manufacturer_params

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def edit
    @manufacturer = Manufacturer.friendly.find params[:id]

UPDATE "manufacturers" SET "image" = ?, "updated_at" = ? WHERE "manufacturers"."id" = ?  [["image", "http://www.carlogos.org/logo/Toyota-logo-1989-2560x1440.png"], ["updated_at", "2017-08-23 11:27:39.870923"], ["id", 2]]
---
  def update
    manufacturer = Manufacturer.friendly.find params[:id]
    manufacturer.update manufacturer_params

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @manufacturer = Manufacturer.friendly.find params[:id]