joshua_mcevoy/week_07/day_02/secrets_server/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets" ORDER BY "secrets"."create_at" DESC
---
  def index
    @secrets = Secret.order(:create_at => 'desc')

INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "I dont like react"], ["created_at", "2017-09-12 02:32:34.650015"], ["updated_at", "2017-09-12 02:32:34.650015"]]
---
  def create
    @secret = Secret.new(secret_params)

    respond_to do |format|
      if @secret.save

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_secret
      @secret = Secret.find(params[:id])