jae-hee_park/week_05/day_02/mount_ains/app/controllers/mountains_controller.rb

  def update
    mountain = Mountain.find params[:id]
    mountain.update :name => params[:name], :image => params[:image], :location => params[:location], :elevation => params[:elevation], :prominence => params[:prominence], :isolation => params[:isolation]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["image", "https://upload.wikimedia.org/wikipedia/commons/6/60/Mount_Kilimanjaro_Dec_2009_edit1.jpg"], ["updated_at", "2017-08-22 05:53:31.350530"], ["id", 1]]