miriam_espinosa/week_05/day_03/books_app/app/controllers/authors_controller.rb

  def create
    author = Author.create author_params
---
INSERT INTO "authors" ("name", "dob", "image", "nationality", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]