miriam_espinosa/week_05/day_03/books_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "publisher", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dfg"], ["author", ""], ["publisher", ""], ["image", ""], ["created_at", "2017-08-23 12:56:15.247192"], ["updated_at", "2017-08-23 12:56:15.247192"]]
---
  def create
    book = Book.create book_params

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find params[:id]

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "publication_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["publication_date", "2015-11-02"], ["updated_at", "2017-08-23 13:40:46.952542"], ["id", 4]]
---
  def update
    book = Book.find params[:id]
    book.update book_params

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find params[:id]

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 6]]
---
  def destroy
      book = Book.find params[:id]
      book.destroy