miriam_espinosa/week_05/day_03/books_app/app/views/authors/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 1]]
---

<% @author.books.each do |book| %>