joshua_mcevoy/week_07/day_02/butterflies_app/app/controllers/plants_controller.rb

  def index
    plants = Plant.all
---
SELECT "plants".* FROM "plants"