miriam_espinosa/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

INSERT INTO "mountains" ("name", "image", "height", "parent", "first_ascent", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    mountain = Mountain.new
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.height = params[:height]
    mountain.parent = params[:parent]
    mountain.first_ascent = params[:first_ascent]
    mountain.country = params[:country]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 5]]
---
  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["image", "https://www.rmiguides.com/_includes/_images/programs/everest-header.jpg"], ["updated_at", "2017-08-22 14:29:53.421926"], ["id", 1]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.update :name => params[:name], :image => params[:image], :height => params[:height], :parent => params[:parent], :first_ascent => params[:first_ascent], :country => params[:country]