joshua_mcevoy/week_10/day_04/fruitstore/app/controllers/fruits_controller.rb

SELECT "fruits".* FROM "fruits" ORDER BY created_at DESC
---
  def index
    @fruits = Fruit.order('created_at DESC')

INSERT INTO "fruits" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2017-09-28 05:55:58.502410"], ["updated_at", "2017-09-28 05:55:58.502410"], ["name", "Blueberry"]]
---
  def create
    @fruit = Fruit.new fruit_params
    if @fruit.save