joshua_mcevoy/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

INSERT INTO "mountains" ("name", "image", "first_climber", "year_climbed", "height", "deaths", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    mountain = Mountain.create :name => params[:name], :image => params[:image], :first_climber => params[:first_climber], :year_climbed => params[:year_climbed], :height => params[:height], :deaths => params[:deaths]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find params[:id]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 7]]
---
  def destroy
    mountain = Mountain.find params[:id]
    mountain.destroy

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find params[:id]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "mountains" SET "first_climber" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["first_climber", "Some dude"], ["updated_at", "2017-08-22 10:52:04.202392"], ["id", 9]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.update :name => params[:name], :image => params[:image], :first_climber => params[:first_climber], :year_climbed => params[:year_climbed], :height => params[:height], :deaths => params[:deaths]